{
	"franchiseTransfer": {
		"rosterId": 2,
		"newOwnerName": "Nam Nguyen",
		"newDisplayName": "Nam",
		"effectiveSeason": 2026
	},
	"seasonRollover": {
		"draftOrder": {
			"1": 3,
			"2": 11,
			"3": 4,
			"4": 8,
			"5": 6,
			"6": 7,
			"7": 2,
			"8": 10,
			"9": 9,
			"10": 5,
			"11": 12,
			"12": 1
		},
		"dateOverrides": {
			"nflDraft": "2026-04-23"
		}
	},
	"tradeAmendments": [
		{
			"tradeId": 34,
			"notes": "The agreed-to version of this trade attached the following condition to the 3rd round draft pick: conditionally upgrades to a 2nd round draft pick should Patrick win a 2011 playoff game. Patrick lost in the semifinals so it remained a 3rd rounder."
		},
		{
			"tradeId": 36,
			"notes": "The agreed-to version of this trade attached the following condition to the 4th round draft pick: conditionally upgrades to a 3rd round draft pick should John win a 2011 playoff game. John didn't make the playoffs so it remained a 4th rounder."
		},
		{
			"tradeId": 37,
			"notes": "The agreed-to version of this trade attached the following condition to the 2nd round draft pick: conditionally downgrades to a 3rd round draft pick should Patrick win a 2011 playoff game. It also attached the following condition to the 3rd round draft pick: conditionally downgrades to a 4th round draft pick should John win a 2011 playoff game. Patrick lost in the semifinals and John didn't make the playoffs so the picks remained 2nd and 3rd rounders, respectively."
		},
		{
			"tradeId": 94,
			"notes": "The origins of all four picks in this trade are self-explanatory: none of them had been traded until this deal was made."
		},
		{
			"tradeId": 299,
			"notes": "Brett/Luke originally owned both RFA rights; Koci/Mueller originally owned the future 2nd and 3rd; Schex originally owned the 3.04 and 3.11."
		},
		{
			"tradeId": 331,
			"notes": "The 2022 picks involved in this trade should not have been available to Quinn to trade in 2019. It was erroneously approved by the commissioner but not definitively ruled a mistake until it was seen as too late to roll back."
		},
		{
			"tradeId": 485,
			"notes": "Schex originally owned both Khalil Herbert and Montrell Washington; Justin originally owned Dallas Goedert. Keyon did not give up an asset in this trade."
		}
	],
	"tradeCashCorrections": [
		{
			"tradeId": 688,
			"party": 0,
			"cash": 0,
			"remove": true,
			"notes": "The agreed-to version of this trade moved $15 from Schexes to Patrick in 2025. That transaction was never carried out on the spreadsheet, though, and the error was not noticed by anyone until over a year later."
		},
		{
			"tradeId": 600,
			"party": 1,
			"cash": 0,
			"season": 2026,
			"notes": "The agreed-to version of this trade moved the $20 from Keyon to Mitch in 2025, not 2026. The transaction was incorrectly carried out on the spreadsheet and not noticed by anyone until nearly two years later."
		}
	]
}